snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт_Коробки_Актуальные/СтатусыКМ_Факт_Коробки_Актуальные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт_Коробки_Актуальные</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДокУстановкиСтатуса</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.ЛистМаркировки</types>
      <types>DocumentRef.ЛистМаркировкиОстатков</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт_А/СтатусыКМ_Факт_А.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт_А</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт_Коробки_Актуальные/ManagerModule.bsl
Функция СформироватьДвижения(Регистратор) Экспорт
	Если НЕ Метаданные.РегистрыСведений.СтатусыКМ_Факт_А.СтандартныеРеквизиты.Регистратор.Тип.СодержитТип(ТипЗнч(Регистратор)) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Период,
	|	Регистратор,
	|	ТипШК,
	|	ШтрихКодУпаковки,
	|	Статус,
	|	Местонахождение,
	|	ВПути,
	|	ШтрихКодУпаковки.СпособВводаВОборот КАК СпособВводаВОборот
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
	|ГДЕ
	|	Регистратор = &Регистратор
	|	И ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	НЗ = РегистрыСведений.СтатусыКМ_Факт_А.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор, Истина);
	
	НЗ.Загрузить(Запрос.Выполнить().Выгрузить());
	
	НЗ.Записать();	
КонецФункции //СформироватьДвижения(Регистратор) Экспорт
